Reports/ПересортТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>ПересортТоваров</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РасширеннаяНастройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтрицательноеКрасным</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначенияНастроекПанелиПользователя</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыПанелиПользователя</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеЭлементаОтчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПредставленияЭлементовОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расшифровки</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/ДвиженияТоваровПоЛистамУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ДвиженияТоваровПоЛистамУчета</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиницаПеремещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДвиженияТовара</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидДвиженияТовараПоЛистуУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияСвойствСтруктурныхЕдиниц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствСтруктурныхЕдиниц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваСтруктурныхЕдиниц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КоличествоВКоробкеПоДням.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>КоличествоВКоробкеПоДням</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>День</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидДвиженияТовараПоЛистуУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидДвиженияТовараПоЛистуУчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеПоКачеству</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дегустация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Акция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученоСДругойТТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленоНаДругуюТТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеБезВозвратаНаСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комплектация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Производство</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыТорговыхТочек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СтатусыТорговыхТочек</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СкороОткрытие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СкороЗакрытие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Открыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приостановлен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыРозничныхТочек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыРозничныхТочек</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Избенка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Магазин</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перекресток</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Микромаркет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пятерочка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПространствоВкуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вкусомат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тилси</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркетПлейс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыРасходныхОрдеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СтатусыРасходныхОрдеров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеОбработан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВСборке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийРасходСкладскойУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРасходСкладскойУчет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаВПереработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаВТорговуюТочку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаТехнологу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаОборудованияВТорговуюТочку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реализация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеВСебестоимость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеНаНуждыСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеОтходовОтПереработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утилизация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УтилизацияБой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеНаПитаниеСотрудниковСклада</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ПересортТоваров/Ext/ObjectModule.bsl
Перем СохраненнаяНастройка Экспорт;        // Текущий вариант отчета

Перем ТаблицаВариантовОтчета Экспорт;      // Таблица вариантов доступных текущему пользователю

Перем СоответствиеНаборовДанныхИЗапросов;
	
Функция СформироватьОтчет(Результат = Неопределено, ДанныеРасшифровки = Неопределено, ВыводВФормуОтчета = Истина) Экспорт
	
	Если ДанныеРасшифровки = Неопределено тогда
		ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КонецЕсли;
	
	НастрокаПоУмолчанию        = КомпоновщикНастроек.ПолучитьНастройки();
	ИнфокомТиповыеОтчеты.ПолучитьПримененуюНастройку(ЭтотОбъект);
	
	
	ПараметрНачалоПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
	ПараметрКонецПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
	ТаблицаДанныхПоПоступлению = Неопределено;
	Если ПараметрНачалоПериода = Неопределено Или ПараметрКонецПериода = Неопределено тогда
		Возврат Неопределено;
	Иначе
		
		НачалоПериода = ?(ПараметрНачалоПериода.Значение <> Неопределено, Дата(ПараметрНачалоПериода.Значение), '00010101');
		КонецПериода  = ?(ПараметрКонецПериода.Значение <> Неопределено, Дата(ПараметрКонецПериода.Значение), '00010101');
		
		ТаблицаДанныхПоПоступлению = ВнешниеДанные.ПолучитьДвиженияТоваровПолная(НачалоПериода, КонецПериода);
	КонецЕсли;
	
	ВнешниеНаборыДанных=Новый Структура;
    ВнешниеНаборыДанных.Вставить("ТаблицаДанныхПоПоступлению", ТаблицаДанныхПоПоступлению);
	
	ИнфокомТиповыеОтчеты.СформироватьТиповойОтчет(ЭтотОбъект, Результат, ДанныеРасшифровки, ВыводВФормуОтчета, ВнешниеНаборыДанных);
	КомпоновщикНастроек.ЗагрузитьНастройки(НастрокаПоУмолчанию);
	УправлениеОтчетамиИнфоком.УстановитьЗапросыСКДПоСоответсвию(СхемаКомпоновкиДанных.НаборыДанных, СоответствиеНаборовДанныхИЗапросов);
	
	Возврат Результат;
	
КонецФункции

Процедура УдалитьЛишниеПредставленияВШапке(Результат)
	
	Ячейка = Результат.НайтиТекст("Удалить", , , , истина, Истина, ложь);
	Пока Ячейка <> Неопределено Цикл
		УдаляемаяОбласть = Результат.Область("R"+Ячейка.Верх);
		Результат.УдалитьОбласть(УдаляемаяОбласть, ТипСмещенияТабличногоДокумента.ПоВертикали);
		Ячейка = Результат.НайтиТекст("Удалить", , , , истина, Истина, ложь);
	КонецЦикла;
	
КонецПроцедуры

Процедура СохранитьНастройку() Экспорт

	СтруктураНастроек = ИнфокомТиповыеОтчеты.ПолучитьСтруктуруПараметровТиповогоОтчета(ЭтотОбъект);
	СохранениеНастроек.СохранитьНастройкуОбъекта(СохраненнаяНастройка, СтруктураНастроек);
	
КонецПроцедуры

Процедура ПрименитьНастройку() Экспорт
	
	Схема = ИнфокомТиповыеОтчеты.ПолучитьСхемуКомпоновкиОбъекта(ЭтотОбъект);

	// Считываение структуры настроек отчета
 	Если Не СохраненнаяНастройка.Пустая() Тогда
		
		СтруктураНастроек = СохраненнаяНастройка.ХранилищеНастроек.Получить();
		Если Не СтруктураНастроек = Неопределено Тогда
			КомпоновщикНастроек.ЗагрузитьНастройки(СтруктураНастроек.НастройкиКомпоновщика);
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураНастроек);
		Иначе
			КомпоновщикНастроек.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
		КонецЕсли;
		
	Иначе
		КомпоновщикНастроек.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
	КонецЕсли;

КонецПроцедуры

	
// Настройка отчета при отработки расшифровки
Процедура Настроить(Отбор) Экспорт
	
	// Настройка отбора
	Для каждого ЭлементОтбора Из Отбор Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			ПолеОтбора = ЭлементОтбора.ЛевоеЗначение;
		Иначе
			ПолеОтбора = Новый ПолеКомпоновкиДанных(ЭлементОтбора.Поле);
		КонецЕсли;
		
		Если КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(ПолеОтбора) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			ЗаполнитьЗначенияСвойств(НовыйЭлементОтбора, ЭлементОтбора);
		Иначе
			НовыйЭлементОтбора.Использование  = Истина;
			НовыйЭлементОтбора.ЛевоеЗначение  = ПолеОтбора;
			Если ЭлементОтбора.Иерархия Тогда
				Если ТипЗнч(ЭлементОтбора.Значение) = Тип("СписокЗначений") Тогда
					НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии;
				Иначе
					НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
				КонецЕсли;
			Иначе
				Если ТипЗнч(ЭлементОтбора.Значение) = Тип("СписокЗначений") Тогда
					НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
				Иначе
					НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				КонецЕсли;
			КонецЕсли;
			
			НовыйЭлементОтбора.ПравоеЗначение = ЭлементОтбора.Значение;
			
		КонецЕсли;                                    
				
	КонецЦикла;
	
	ИнфокомТиповыеОтчеты.УдалитьДублиОтбора(КомпоновщикНастроек);
	
КонецПроцедуры

Функция ЕстьДетальныеПоля(ВыбранныеПоля)
	ЕстьРесурсы = ложь;
	Для каждого ВыбраноеПоле из ВыбранныеПоля Цикл
		ДоступноеПоле = ИнфокомТиповыеОтчеты.ПолучитьДоступноеПолеПоПолюКомпоновкиДанных(ВыбраноеПоле.Поле, КомпоновщикНастроек);
		Если ДоступноеПоле <> Неопределено тогда
			Если ДоступноеПоле.Ресурс тогда
				ЕстьРесурсы = истина;
			Иначе
				ЕстьРесурсы = ложь;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат Не ЕстьРесурсы;
КонецФункции

Процедура ДоработатьКомпоновщикПередВыводом() Экспорт
	
	ИнфокомТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "ТекущаяДата",   ТекущаяДата());
	
	//ЕстьКодДохода                = ПрисутствуетПоле("КодДохода");
	//ЕстьВидРасчета               = ПрисутствуетПоле("ВидРасчета");
	//ЕстьРегистратор              = ПрисутствуетПоле("Регистратор"); 
	//ЕстьСтавкаНалогообложения    = ПрисутствуетПоле("НДФЛ.СтавкаНалогообложенияНДФЛ"); 
	//ЕстьФизЛицо                  = ПрисутствуетПоле("Сотрудник");
	//ЕстьКПП                      = ПрисутствуетПоле("КПП");
	//							   
	//ЕстьНалоговыйРежим                    = ПрисутствуетПоле("НалоговыйРежим");
	//ЕстьВидПособия                        = ПрисутствуетПоле("Пособия.ВидПособия");
	//ЕстьИнвалид                           = ПрисутствуетПоле("Взносы.Инвалид");
	//ЕстьРебенок                           = ПрисутствуетПоле("Пособия.Ребенок");
	//ЕстьВидЗанятости                      = ПрисутствуетПоле("Пособия.ВидЗанятости");
	//ЕстьСреднийЗаработок                  = ПрисутствуетПоле("Пособия.РазмерСреднегоЗаработка");
	//ЕстьВидСтрахования                    = ПрисутствуетПоле("Пособия.ВидСтрахования");
	//ЕстьКодПоОКАТО                        = ПрисутствуетПоле("НДФЛ.КодПоОКАТО"); 
	//ЕстьВычет                             = ПрисутствуетПоле("НДФЛ.КодВычетНДФЛ"); 
	//
	//ЕстьВидДохода                         = ПрисутствуетПоле("ВидДохода");
	//ЕстьВидТарифаСтраховыхВзносов         = ПрисутствуетПоле("ВидТарифаСтраховыхВзносов");
	//ЕстьРодилсяДо1967                     = ПрисутствуетПоле("РодилсяДо1967");
	//ЕстьОблагаетсяПоДополнительномуТарифу = ПрисутствуетПоле("ОблагаетсяПоДополнительномуТарифу");
	//ЕстьВыплатаЗаСчетФедеральногоБюджета = ПрисутствуетПоле("Пособия.ВыплатаЗаСчетФедеральногоБюджета");
	//
	//ИнфокомТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "КПП",   ЕстьКПП);
	//ИнфокомТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "Инвалид",   ЕстьИнвалид);
	//ИнфокомТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "КодДохода",   ЕстьКодДохода);
	//ИнфокомТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "ВидРасчета",  ЕстьВидРасчета);
	//ИнфокомТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "Регистратор", ЕстьРегистратор);
	//ИнфокомТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "СтавкаНалогообложенияРезидента", ЕстьСтавкаНалогообложения);
	//ИнфокомТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "ФизЛицо",     ЕстьФизЛицо);
	//ИнфокомТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "НалоговыйРежим",     ЕстьНалоговыйРежим);
	//ИнфокомТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "ВидПособия",              ЕстьВидПособия);
	//ИнфокомТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "Ребенок",                 ЕстьРебенок);
	//ИнфокомТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "ВидЗанятости",            ЕстьВидЗанятости);
	//ИнфокомТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "РазмерСреднегоЗаработка", ЕстьСреднийЗаработок);
	//ИнфокомТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "ВидСтрахования",          ЕстьВидСтрахования);
	//ИнфокомТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "КодПоОКАТО",              ЕстьКодПоОКАТО);
	//ИнфокомТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "Вычет",                   ЕстьВычет);
	//
	//ИнфокомТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "ВидДохода",                 ЕстьВидДохода);
	//ИнфокомТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "ВидТарифаСтраховыхВзносов", ЕстьВидТарифаСтраховыхВзносов);
	//ИнфокомТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "РодилсяДо1967",             ЕстьРодилсяДо1967);
	//ИнфокомТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "ОблагаетсяПоДополнительномуТарифу", ЕстьОблагаетсяПоДополнительномуТарифу);
	//ИнфокомТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "ВыплатаЗаСчетФедеральногоБюджета", ЕстьВыплатаЗаСчетФедеральногоБюджета);
	//
	//
	//Если ЕстьВычет тогда 
	//	Если ЕстьКодДохода тогда 
	//		Сообщить("Поле Вычет не возможно использовать с группировкой или отбором по полю ""Код дохода"".");
	//	КонецЕсли;
	//КонецЕсли;
	//
	//ВыбранныеПоля = ИнфокомТиповыеОтчеты.ПолучитьВыбранныеПоля(КомпоновщикНастроек);
	//
	//СписокПолей = Новый СписокЗначений;
	//
	//Для каждого ВыбранноеПоле из ВыбранныеПоля Цикл
	//	ДоступноеПоле = ИнфокомТиповыеОтчеты.ПолучитьДоступноеПолеПоПолюКомпоновкиДанных(ВыбранноеПоле.Поле, КомпоновщикНастроек);
	//	Если ДоступноеПоле <> Неопределено И ДоступноеПоле.Родитель <> Неопределено тогда
	//		Если ЕстьКодДохода тогда
	//			Если Найти(ДоступноеПоле.Поле, "Пособия.") <> 0 тогда
	//				Сообщить("Поле """ + ДоступноеПоле.Заголовок + """ не возможно вывести одновременно с группировкой или отбором по полю ""Код по ОКАТО"".");
	//				ДобавитьПустоеОформдениеПоля(ВыбранноеПоле.Поле);
	//				СписокПолей.Добавить(ДоступноеПоле.Поле);
	//			КонецЕсли;
	//			Если Найти(ДоступноеПоле.Поле, "ЕСН.") = 0 и Найти(ДоступноеПоле.Поле, "База") = 0 и Строка(ДоступноеПоле.Поле) <> "ЕСН.Начислено" и Строка(ДоступноеПоле.Поле) <> "ЕСН.НачисленоСкидка" тогда
	//				Сообщить("Поле """ + ДоступноеПоле.Заголовок + """ не возможно вывести одновременно с группировкой или отбором по полю ""Вид расчета"".");
	//				ДобавитьПустоеОформдениеПоля(ДоступноеПоле.Поле);
	//				СписокПолей.Добавить(ДоступноеПоле.Поле);
	//			КонецЕсли;
	//		КонецЕсли;
	//		Если ЕстьВидРасчета тогда
	//			Если Найти(ДоступноеПоле.Поле, "База") = 0 и Строка(ДоступноеПоле.Поле) <> "Взносы.Начислено" и Строка(ДоступноеПоле.Поле) <> "Взносы.НеОблагаетсяЦеликом" тогда
	//				Сообщить("Поле """ + ДоступноеПоле.Заголовок + """ не возможно вывести одновременно с группировкой или отбором по полю ""Вид расчета"".");
	//				ДобавитьПустоеОформдениеПоля(ДоступноеПоле.Поле);
	//				СписокПолей.Добавить(ДоступноеПоле.Поле);
	//			КонецЕсли;
	//		КонецЕсли;
	//		Если ЕстьРегистратор тогда
	//			Если Найти(ДоступноеПоле.Поле, "ФССНС.") <> 0 тогда
	//				Сообщить("Поле """ + ДоступноеПоле.Заголовок + """ не возможно вывести одновременно с группировкой или отбором по полю ""Регистратор"".");
	//				ДобавитьПустоеОформдениеПоля(ДоступноеПоле.Поле);
	//				СписокПолей.Добавить(ДоступноеПоле.Поле);
	//			КонецЕсли;
	//		КонецЕсли;
	//		Если ЕстьСтавкаНалогообложения	тогда
	//			Если Найти(ДоступноеПоле.Поле, "НДФЛ.") = 0 тогда
	//				Сообщить("Поле """ + ДоступноеПоле.Заголовок + """ не возможно вывести одновременно с группировкой или отбором по полю ""Ставка налогообложения"".");
	//				ДобавитьПустоеОформдениеПоля(ДоступноеПоле.Поле);
	//				СписокПолей.Добавить(ДоступноеПоле.Поле);
	//			КонецЕсли;
	//		КонецЕсли;
	//		Если ЕстьФизЛицо тогда
	//			Если Найти(ДоступноеПоле.Поле, "ФССНС.") <> 0 тогда
	//				Сообщить("Поле """ + ДоступноеПоле.Заголовок + """ не возможно вывести одновременно с группировкой или отбором по полю ""Сотрудник"".");
	//				ДобавитьПустоеОформдениеПоля(ДоступноеПоле.Поле);
	//				СписокПолей.Добавить(ДоступноеПоле.Поле);
	//			КонецЕсли;
	//		КонецЕсли;
	//		Если ЕстьВидПособия или ЕстьРебенок или ЕстьВидЗанятости или ЕстьСреднийЗаработок или ЕстьВидСтрахования тогда
	//			Если Найти(ДоступноеПоле.Поле, "Пособия.") = 0 тогда
	//				Сообщить("Поле """ + ДоступноеПоле.Заголовок + """ не возможно вывести одновременно с группировкой или отбором по полю ""Вид пособия"".");
	//				ДобавитьПустоеОформдениеПоля(ДоступноеПоле.Поле);
	//				СписокПолей.Добавить(ДоступноеПоле.Поле);
	//			КонецЕсли;
	//		КонецЕсли;
	//		Если ЕстьНалоговыйРежим тогда
	//			Если Найти(ДоступноеПоле.Поле, "ЕСН.") = 0 и Найти(ДоступноеПоле.Поле, "ПФР.") = 0 тогда
	//				Сообщить("Поле """ + ДоступноеПоле.Заголовок + """ не возможно вывести одновременно с группировкой или отбором по полю ""Налоговый режим"".");
	//				ДобавитьПустоеОформдениеПоля(ДоступноеПоле.Поле);
	//				СписокПолей.Добавить(ДоступноеПоле.Поле);
	//			КонецЕсли;
	//		КонецЕсли;
	//		Если ЕстьВычет тогда
	//			Если Найти(ДоступноеПоле.Поле, "НалогНДФЛ") <> 0 или Найти(ДоступноеПоле.Поле, "НалогНДФЛУдержаный") <> 0 
	//				или Найти(ДоступноеПоле.Поле, "БазаНДФЛ") <> 0 или Найти(ДоступноеПоле.Поле, "СуммаДоходаНеОблагаемая") <> 0 тогда
	//				Сообщить("Поле """ + ДоступноеПоле.Заголовок + """ не возможно вывести одновременно с группировкой или отбором по полю ""Вычет НДФЛ"".");
	//				ДобавитьПустоеОформдениеПоля(ДоступноеПоле.Поле);
	//				СписокПолей.Добавить(ДоступноеПоле.Поле);
	//			КонецЕсли;
	//		КонецЕсли;
	//		Если ЕстьВидДохода тогда
	//			Если Найти(ДоступноеПоле.Поле, "Взносы.ФССНесчастныеСлучаи") <> 0 или Найти(ДоступноеПоле.Поле, "Взносы.ТФОМС") <> 0 
	//				или Найти(ДоступноеПоле.Поле, "Взносы.ФФОМС") <> 0 или Найти(ДоступноеПоле.Поле, "Взносы.ТФОМС") <> 0
	//				или Найти(ДоступноеПоле.Поле, "Взносы.ФСС") <> 0 или Найти(ДоступноеПоле.Поле, "Взносы.ПФРПоДополнительномуТарифу") <> 0
	//				или Найти(ДоступноеПоле.Поле, "Взносы.ПФРНакопительная") <> 0 или Найти(ДоступноеПоле.Поле, "Взносы.ПФРСтраховая") <> 0 тогда
	//				
	//				Сообщить("Поле """ + ДоступноеПоле.Заголовок + """ не возможно вывести одновременно с группировкой или отбором по полю ""Вид дохода"".");
	//				ДобавитьПустоеОформдениеПоля(ДоступноеПоле.Поле);
	//				СписокПолей.Добавить(ДоступноеПоле.Поле);
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;

	//Если ЕстьДетальныеПоля(ВыбранныеПоля) тогда
	//	Возврат;
	//КонецЕсли;
	//
	//ДобавитьОтборИлиПоВсемПоказателям(КомпоновщикНастроек.Настройки, ВыбранныеПоля, СписокПолей);
	
	ПараметрНачалоПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
	ПараметрКонецПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
	
	Если ПараметрНачалоПериода = Неопределено или ПараметрКонецПериода = Неопределено тогда
		Возврат;
	Иначе
		НачалоПериода = ?(ПараметрНачалоПериода.Значение <> Неопределено, Дата(ПараметрНачалоПериода.Значение), '00010101');
		КонецПериода  = ?(ПараметрКонецПериода.Значение <> Неопределено, Дата(ПараметрКонецПериода.Значение), '00010101');
		Если НачалоПериода = '00010101'  тогда
			НачалоПериода = НачалоМесяца(ТекущаяДата());
		КонецЕсли;
		Если КонецПериода = '00010101' тогда
			КонецПериода = КонецМесяца(ТекущаяДата());
		КонецЕсли;
		ПараметрКонецПериода.Использование = Истина;
		ПараметрНачалоПериода.Использование = Истина;
		
		ПараметрКонецПериода.Значение  = КонецПериода;
		ПараметрНачалоПериода.Значение = НачалоПериода;
	КонецЕсли;
	
	Если НачалоПериода <> Неопределено и КонецПериода <> Неопределено тогда
		УправлениеОтчетамиИнфоком.ЗаменитьВСКДТекстЗапросКалендаря(СхемаКомпоновкиДанных, НачалоПериода, КонецПериода, СоответствиеНаборовДанныхИЗапросов);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПустоеОформдениеПоля(Поле)
	
	УсловноеОформление = КомпоновщикНастроек.Настройки.УсловноеОформление.Элементы.Добавить();
	ЗначениеТекст = УсловноеОформление.Оформление.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Text"));
	ЗначениеТекст.Значение = "-";
	ЗначениеТекст.Использование = Истина;
	
	ПолеОформления = УсловноеОформление.Поля.Элементы.Добавить();
	ПолеОформления.Использование = Истина;
	ПолеОформления.Поле = Поле;
	
КонецПроцедуры


Процедура ДобавитьОтборИлиПоВсемПоказателям(СтруктураОтчета, ВыбранныеПоля, СписокПолей)
	// создадим отбор или 
	ГруппаИли = СтруктураОтчета.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Для каждого ВыбранноеПоле из ВыбранныеПоля Цикл
		Если Найти(Строка(ВыбранноеПоле.Поле), "UserField") > 0 или СписокПолей.НайтиПоЗначению(ВыбранноеПоле.Поле) <> Неопределено тогда
			Продолжить;
		КонецЕсли;
		ИнфокомТиповыеОтчеты.ДобавитьОтбор(ГруппаИли, Строка(ВыбранноеПоле.Поле), 0, ВидСравненияКомпоновкиДанных.НеРавно);
	КонецЦикла;
	Если ГруппаИли.Элементы.Количество() = 0 тогда
		ГруппаИли.Использование = истина;
	КонецЕсли;
	Если ГруппаИли.Элементы.Количество() = 0 тогда
		СтруктураОтчета.Отбор.Элементы.Удалить(ГруппаИли);
	КонецЕсли;
КонецПроцедуры


Функция ПрисутствуетПоле(Поле)
	
	ЕстьГруппировка = ложь;
	
	ЕстьГруппировка = НайтиПоле(КомпоновщикНастроек.Настройки.Структура, Поле);

	
	//Для каждого ЭлементСтруктуры из КомпоновщикНастроек.Настройки.Структура Цикл
	//	
	//	Если Тип(ЭлементСтруктуры) = Тип("ТаблицаКомпоновкиДанных") тогда
	//		
	//		ЕстьГруппировка = НайтиПоле(ЭлементСтруктуры.Строки, Поле) или НайтиПоле(ЭлементСтруктуры.Колонки, Поле);
	//		
	//	ИначеЕсли Тип(ЭлементСтруктуры) = Тип("ГруппировкаКомпоновкиДанных") тогда
	//		
	//		ЕстьГруппировка = НайтиПоле(ЭлементСтруктуры.Структура, Поле);
	//		
	//	ИначеЕсли Тип(ЭлементСтруктуры) = Тип("ДиаграммаКомпоновкиДанных") тогда
	//		
	//		Если ЭлементСтруктуры.Точки.Количество() <> 0 тогда
	//			
	//			ЕстьГруппировка = НайтиПоле(ЭлементСтруктуры.Точки, Поле) ИЛИ НайтиПоле(ЭлементСтруктуры.Серии, Поле);
	//			
	//		КонецЕсли;
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла;
	
	Если ЕстьГруппировка тогда
		Возврат ЕстьГруппировка;
	КонецЕсли;
	
	// найти поле группировки в отборе
	Для каждого ОтборПоле из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		
		ПолеПериодРегистрации = Новый ПолеКомпоновкиДанных(Поле);
		
		Если ТипЗнч(ОтборПоле) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") тогда
			ЕстьГруппировка = ИспользуетсяОтбор(ОтборПоле.Элементы, ПолеПериодРегистрации);
		Иначе
			Если ОтборПоле.Использование и (ОтборПоле.ЛевоеЗначение = ПолеПериодРегистрации или ОтборПоле.ПравоеЗначение = ПолеПериодРегистрации) тогда
				
				ЕстьГруппировка = истина;
				
				Прервать;
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ВыбранныеПоля = ИнфокомТиповыеОтчеты.ПолучитьВыбранныеПоля(КомпоновщикНастроек);
	
	Для каждого ПолеВыбора из ВыбранныеПоля Цикл
		
		ПолеПериодРегистрации = Новый ПолеКомпоновкиДанных(Поле);
		
		Если ТипЗНЧ(ПолеВыбора) = Тип("ВыбранноеПолеКомпоновкиДанных") И ПолеВыбора.Использование И ПолеВыбора.Поле = ПолеПериодРегистрации тогда
			
			ЕстьГруппировка = истина;
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	
	Возврат ЕстьГруппировка;
	
КонецФункции 

Функция ИспользуетсяОтбор(Элементы, ПолеПериодРегистрации)
	
	ЕстьГруппировка = ложь;
	
	Для каждого ОтборПоле из Элементы Цикл
		
		Если ТипЗнч(ОтборПоле) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") тогда
			ЕстьГруппировка = ИспользуетсяОтбор(ОтборПоле.Элементы, ПолеПериодРегистрации);
		Иначе
			Если ОтборПоле.Использование и (ОтборПоле.ЛевоеЗначение = ПолеПериодРегистрации или ОтборПоле.ПравоеЗначение = ПолеПериодРегистрации) тогда
				
				ЕстьГруппировка = истина;
				
				Прервать;
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ЕстьГруппировка;
	
КонецФункции

// Функция возвращает значение истина, если в группировках элементов структуры присутствует поле "Период регистрации"
//
Функция НайтиПоле(Структура, Поле)
	
	ЕстьПоле = ложь;
	
	Если ТипЗнч(Структура) <> Тип("КоллекцияЭлементовСтруктурыНастроекКомпоновкиДанных") 
	 и ТипЗнч(Структура) <> Тип("КоллекцияЭлементовСтруктурыТаблицыКомпоновкиДанных") 
	 и ТипЗнч(Структура) <> Тип("КоллекцияЭлементовСтруктурыДиаграммыКомпоновкиДанных") 
	 тогда
		
		Возврат ЕстьПоле;
		
	КонецЕсли;
	
	ПолеПериодРегистрации = Новый ПолеКомпоновкиДанных(Поле);
	
	Для каждого ЭлементСтруктуры из Структура Цикл
		
		Если Тип(ЭлементСтруктуры) = Тип("ГруппировкаКомпоновкиДанных") 
			или  Тип(ЭлементСтруктуры) = Тип("ГруппировкаТаблицыКомпоновкиДанных") 
			или  Тип(ЭлементСтруктуры) = Тип("ГруппировкаДиаграммыКомпоновкиДанных") тогда
			Для каждого ПолеГруппировки из ЭлементСтруктуры.ПоляГруппировки.Элементы Цикл
				Если ТипЗнч(ПолеГруппировки) = Тип("АвтоПолеГруппировкиКомпоновкиДанных") тогда
					Продолжить;
				КонецЕсли;
				Если ПолеГруппировки.Использование И ПолеГруппировки.Поле = ПолеПериодРегистрации тогда
					ЕстьПоле = истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если ЕстьПоле тогда
			Прервать;
		КонецЕсли;
		Если Тип(ЭлементСтруктуры) = Тип("ТаблицаКомпоновкиДанных") тогда
			ЕстьПоле = НайтиПоле(ЭлементСтруктуры.Строки, Поле) или НайтиПоле(ЭлементСтруктуры.Колонки, Поле);
		ИначеЕсли Тип(ЭлементСтруктуры) = Тип("ГруппировкаКомпоновкиДанных") 
			или  Тип(ЭлементСтруктуры) = Тип("ГруппировкаТаблицыКомпоновкиДанных") 
			или  Тип(ЭлементСтруктуры) = Тип("ГруппировкаДиаграммыКомпоновкиДанных") тогда
			ЕстьПоле = НайтиПоле(ЭлементСтруктуры.Структура, Поле);
		ИначеЕсли Тип(ЭлементСтруктуры) = Тип("ДиаграммаКомпоновкиДанных") тогда
			Если ЭлементСтруктуры.Точки.Количество() <> 0 тогда
				ЕстьПоле = НайтиПоле(ЭлементСтруктуры.Точки, Поле) ИЛИ НайтиПоле(ЭлементСтруктуры.Серии, Поле);
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;
	
	Возврат ЕстьПоле;
	
КонецФункции //НайтиПоле()

Функция ПолучитьПараметрыИсполненияОтчета() Экспорт
	СписокПолейПодстановкиОтборовПоУмолчанию = Новый Соответствие;
	
	Возврат Новый Структура("ДополнительныеНастройкиОтчета, ИспользоватьСобытияПриФормированииОтчета,
	|ПриВыводеЗаголовкаОтчета,
	|ПослеВыводаПанелиПользователя,
	|ПослеВыводаПериода,
	|ПослеВыводаПараметра,
	|ПослеВыводаГруппировки,
	|ПослеВыводаОтбора,
	|ДействияПанелиИзменениеФлажкаДопНастроек,
	|ПриПолучениеНастроекПользователя, 
	|ЗаполнитьОтборыПоУмолчанию, 
	|СписокПолейПодстановкиОтборовПоУмолчанию", 
	Истина, ложь, ложь, ложь, ложь, ложь, ложь, ложь, ложь, ложь, истина, СписокПолейПодстановкиОтборовПоУмолчанию);
КонецФункции


Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
			
	// Подготовим и выведем отчет.
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	НастройкиКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();
	
	Если ДанныеРасшифровки = Неопределено тогда
		ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КонецЕсли;
	
	ПараметрПериода = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период")).ИдентификаторПользовательскойНастройки);
	ПараметрВладелец= КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Владелец")).ИдентификаторПользовательскойНастройки);
	//ПараметрКонецПериода  = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода")).ИдентификаторПользовательскойНастройки);
	//ПараметрНачалоПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
	//ПараметрКонецПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
	ПараметрПериода = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период")).ИдентификаторПользовательскойНастройки);
	ТаблицаДанныхПоПоступлению = Неопределено;
	Если ПараметрПериода = Неопределено Тогда
		Возврат;
	Иначе
		
		НачалоПериода = ПараметрПериода.Значение.ДатаНачала;
		КонецПериода  = ПараметрПериода.Значение.ДатаОкончания;
		Склад= ПараметрВладелец.Значение;

		
	
		ЗапросПоступившей = Новый Запрос();
		ЗапросПоступившей.Текст = "ВЫБРАТЬ
		                          |	ДвиженияТоваровПоЛистамУчетаОбороты.СтруктурнаяЕдиница КАК ТТ,
		                          |	ДвиженияТоваровПоЛистамУчетаОбороты.Номенклатура,
		                          |	СУММА(ВЫБОР
		                          |			КОГДА ДвиженияТоваровПоЛистамУчетаОбороты.ВидДвиженияТовара = ЗНАЧЕНИЕ(Перечисление.ВидДвиженияТовараПоЛистуУчета.ПоступлениеБезВозвратаНаСклад)
		                          |				ТОГДА ДвиженияТоваровПоЛистамУчетаОбороты.Количество
								  |			ИНАЧЕ 0
		                          |		КОНЕЦ) КАК Поступило,
		                          |	НАЧАЛОПЕРИОДА(ДвиженияТоваровПоЛистамУчетаОбороты.Период, ДЕНЬ) КАК День,
		                          |	СУММА(ВЫБОР
		                          |			КОГДА ДвиженияТоваровПоЛистамУчетаОбороты.ВидДвиженияТовара = ЗНАЧЕНИЕ(Перечисление.ВидДвиженияТовараПоЛистуУчета.Бой)
		                          |				ТОГДА ДвиженияТоваровПоЛистамУчетаОбороты.Количество
		                          |			ИНАЧЕ 0
		                          |		КОНЕЦ) КАК Бой
		                          |ИЗ
		                          |	РегистрНакопления.ДвиженияТоваровПоЛистамУчета КАК ДвиженияТоваровПоЛистамУчетаОбороты
		                          | где Период Между &ДатаНач и &ДатаКон и (ВидДвиженияТовара = ЗНАЧЕНИЕ(Перечисление.ВидДвиженияТовараПоЛистуУчета.ПоступлениеБезВозвратаНаСклад)
		                          |				ИЛИ ВидДвиженияТовара = ЗНАЧЕНИЕ(Перечисление.ВидДвиженияТовараПоЛистуУчета.Бой)) И
								  | НЕ Номенклатура В
		                          |							(ВЫБРАТЬ
		                          |								Номенклатура.Ссылка
		                          |							ИЗ
		                          |								Справочник.Номенклатура КАК Номенклатура
		                          |							ГДЕ
		                          |								Номенклатура.СлужебныйТовар = ИСТИНА)
		                          |СГРУППИРОВАТЬ ПО
		                          |	ДвиженияТоваровПоЛистамУчетаОбороты.СтруктурнаяЕдиница,
		                          |	ДвиженияТоваровПоЛистамУчетаОбороты.Номенклатура,
		                          |	НАЧАЛОПЕРИОДА(ДвиженияТоваровПоЛистамУчетаОбороты.Период, ДЕНЬ)";
		
		ЗапросПоступившей.УстановитьПараметр("ДатаНач", (НачалоДня(НачалоПериода)));
		ЗапросПоступившей.УстановитьПараметр("ДатаКон", (КонецДня(КонецПериода)));
	//	
		ТаблицаДанныхПоПоступлению = ЗапросПоступившей.Выполнить().Выгрузить();
		//+++АК BELN 2018.06.15 ИП-00018914
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СтруктурныеЕдиницы.НомерТочки,
			|	СтруктурныеЕдиницы.id_TT,
			|	СтруктурныеЕдиницы.Ссылка
			|ИЗ
			|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
			|ГДЕ
			|	СтруктурныеЕдиницы.ТипРозничнойТочки = &ТипРозничнойТочки";
		
		Запрос.УстановитьПараметр("СтатусТорговойТочки", Перечисления.СтатусыТорговыхТочек.Закрыт);
		Запрос.УстановитьПараметр("ТипРозничнойТочки", Перечисления.ТипыРозничныхТочек.Перекресток);
		
		РезультатЗапроса = Запрос.Выполнить();
		Выб=РезультатЗапроса.Выбрать();
		МасТТ=Новый Массив;
		Пока Выб.Следующий() Цикл
			МасТТ.Добавить(Выб.Ссылка);
		КонецЦикла; 
		
		ТаблицаДанныхПоПоступлению1=ВнешниеДанные.ПолучитьДвиженияТоваровПолная(НачалоДня(НачалоПериода), КонецДня(КонецПериода),МасТТ);
		Для каждого Стр Из ТаблицаДанныхПоПоступлению1 Цикл
			ЗаполнитьЗначенияСвойств(ТаблицаДанныхПоПоступлению.Добавить(),Стр);
		КонецЦикла; 
		//---АК BELN 2018.06.15 
	КонецЕсли;
	
	КолДней=(НачалоДня(КонецПериода)-НачалоДня(НачалоПериода))/(24*60*60);
	
	
	Дата1=НачалоДня(НачалоПериода);
	Дата2=?(НачалоДня(КонецПериода)<НачалоДня(НачалоПериода)+5*24*60*60,НачалоДня(КонецПериода),НачалоДня(НачалоПериода)+5*24*60*60);
	//Дата2=НачалоДня(КонецПериода);
	Сч=1;
	Пока Дата2<=НачалоДня(КонецПериода) Цикл
		
	
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Склады.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ втСклад
			|ИЗ
			|	Справочник.Склады КАК Склады
			|ГДЕ
			|	Склады.Владелец.ТипСтруктурнойЕдиницы = &ТипСклада
			|	И Склады.Владелец = &Владелец
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РасходныйОрдерСкладТовары.Ссылка,
			|	РасходныйОрдерСкладТовары.Сборщик,
			|	ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Получатель КАК Справочник.СтруктурныеЕдиницы) КАК Получатель,
			|	РасходныйОрдерСкладТовары.Склад,
			|	РасходныйОрдерСкладТовары.Склад.Владелец,
			|	РасходныйОрдерСкладТовары.Дата,
			|	РасходныйОрдерСкладТовары.ДатаРаспределения,
			|	&ТипСклада КАК ТипСтруктурнойЕдиницы,
			|	РасходныйОрдерСкладТовары.ПриемкаВМагазинеБезПересчета,
			|	РасходныйОрдерСкладТовары.Склад.Организация КАК Организация
			|ПОМЕСТИТЬ ТабРасходники
			|ИЗ
			|	Документ.РасходныйОрдерСклад КАК РасходныйОрдерСкладТовары
			|ГДЕ
			|	РасходныйОрдерСкладТовары.Дата МЕЖДУ &ДатаНач И &ДатаКон
			|	И НАЧАЛОПЕРИОДА(ВЫБОР
			|				КОГДА РасходныйОрдерСкладТовары.ДатаРаспределения <> ДАТАВРЕМЯ(1, 1, 1)
			|					ТОГДА РасходныйОрдерСкладТовары.ДатаРаспределения
			|				ИНАЧЕ РасходныйОрдерСкладТовары.Дата
			|			КОНЕЦ, ДЕНЬ) МЕЖДУ &НачалоПериода И &КонецПериода
			|	И РасходныйОрдерСкладТовары.Склад В
			|			(ВЫБРАТЬ
			|				втСклад.Ссылка
			|			ИЗ
			|				втСклад)
			|	И РасходныйОрдерСкладТовары.ВидОперации = &ВидОперации
			|	И РасходныйОрдерСкладТовары.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.ВСборке)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РасходныйОрдерСкладТовары.Ссылка,
			|	РасходныйОрдерСкладТовары.Сборщик,
			|	РасходныйОрдерСкладТовары.Получатель,
			|	РасходныйОрдерСкладТовары.Склад,
			|	РасходныйОрдерСкладТовары.СкладВладелец,
			|	РасходныйОрдерСкладТовары.Дата,
			|	РасходныйОрдерСкладТовары.ДатаРаспределения,
			|	РасходныйОрдерСкладТовары.ТипСтруктурнойЕдиницы,
			|	РасходныйОрдерСкладТовары.ПриемкаВМагазинеБезПересчета,
			|	РасходныйОрдерСкладТовары.Организация КАК Организация,
			|	ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, ЛОЖЬ)
			|		ИЛИ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Получатель КАК Справочник.СтруктурныеЕдиницы).ТипРозничнойТочки = ЗНАЧЕНИЕ(Перечисление.ТипыРозничныхТочек.Вкусомат) КАК ВыезднаяТорговля
			|ПОМЕСТИТЬ ТабРасходники1
			|ИЗ
			|	ТабРасходники КАК РасходныйОрдерСкладТовары
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствСтруктурныхЕдиниц КАК ЗначенияСвойствОбъектов
			|		ПО РасходныйОрдерСкладТовары.Получатель = ЗначенияСвойствОбъектов.СтруктурнаяЕдиница
			|			И (ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваСтруктурныхЕдиниц.ВыездноеМероприятие))
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РасходныйОрдерСкладТовары.Номенклатура КАК Номенклатура,
			|	РасходныйОрдерСкладТовары.Характеристика,
			|	РасходныйОрдерСкладТовары.Ссылка КАК Ссылка,
			|	РасходныйОрдерСкладТовары.Количество,
			|	РасходныйОрдерСкладТовары.КоличествоУРЗ,
			|	РасходныйОрдерСкладТовары.Отклонение,
			|	РасходныйОрдерСкладТовары.ЗаявкаНаСклад,
			|	ТабРасходники.Сборщик,
			|	ВЫРАЗИТЬ(ТабРасходники.Получатель КАК Справочник.СтруктурныеЕдиницы) КАК Получатель,
			|	ТабРасходники.Склад,
			|	ТабРасходники.ВыезднаяТорговля,
			|	ТабРасходники.СкладВладелец,
			|	ТабРасходники.Дата,
			|	ТабРасходники.ДатаРаспределения,
			|	ТабРасходники.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы,
			|	РасходныйОрдерСкладТовары.НомерСтроки,
			|	ТабРасходники.ПриемкаВМагазинеБезПересчета,
			|	РасходныйОрдерСкладТовары.ЗаданиеНаРазборку,
			|	ТабРасходники.Организация
			|ПОМЕСТИТЬ ТабТоварыРасходники
			|ИЗ
			|	Документ.РасходныйОрдерСклад.Товары КАК РасходныйОрдерСкладТовары
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабРасходники1 КАК ТабРасходники
			|		ПО РасходныйОрдерСкладТовары.Ссылка = ТабРасходники.Ссылка
			|ГДЕ
			|	НЕ РасходныйОрдерСкладТовары.Номенклатура В
			|				(ВЫБРАТЬ
			|					Номенклатура.Ссылка
			|				ИЗ
			|					Справочник.Номенклатура КАК Номенклатура
			|				ГДЕ
			|					Номенклатура.СлужебныйТовар)
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура,
			|	Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЗаданиеНаРазборку.Сборщик КАК Сборщик,
			|	ЗаданиеНаРазборку.Ссылка
			|ПОМЕСТИТЬ втЗадания
			|ИЗ
			|	Документ.ЗаданиеНаРазборку КАК ЗаданиеНаРазборку
			|ГДЕ
			|	ЗаданиеНаРазборку.Ссылка В
			|			(ВЫБРАТЬ
			|				ТабТоварыРасходники.ЗаданиеНаРазборку
			|			ИЗ
			|				ТабТоварыРасходники)
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ЗаданиеНаРазборку.Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РасходныйОрдерСкладТовары.Номенклатура КАК Номенклатура,
			|	МАКСИМУМ(ВЫБОР
			|			КОГДА ЕСТЬNULL(ЗначенияСвойствОбъектов.Количество, ЗначенияПоХарактеристике.Значение) = 0
			|				ТОГДА 1
			|			ИНАЧЕ ЕСТЬNULL(ЗначенияСвойствОбъектов.Количество, ЗначенияПоХарактеристике.Значение)
			|		КОНЕЦ) КАК КоличествоВУпаковке,
			|	РасходныйОрдерСкладТовары.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ ТабТовары
			|ИЗ
			|	ТабТоварыРасходники КАК РасходныйОрдерСкладТовары
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КоличествоВКоробкеПоДням КАК ЗначенияСвойствОбъектов
			|		ПО РасходныйОрдерСкладТовары.Характеристика = ЗначенияСвойствОбъектов.Характеристика
			|			И РасходныйОрдерСкладТовары.Ссылка.Склад.Владелец = ЗначенияСвойствОбъектов.СтруктурнаяЕдиница
			|			И (ЗначенияСвойствОбъектов.День = НАЧАЛОПЕРИОДА(РасходныйОрдерСкладТовары.Ссылка.Дата, ДЕНЬ))
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияПоХарактеристике
			|		ПО РасходныйОрдерСкладТовары.Характеристика = ЗначенияПоХарактеристике.Объект
			|			И (ЗначенияПоХарактеристике.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.КоличествоВУпаковке))
			|
			|СГРУППИРОВАТЬ ПО
			|	РасходныйОрдерСкладТовары.Номенклатура,
			|	РасходныйОрдерСкладТовары.Ссылка
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура,
			|	Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РасходныйОрдерСкладТовары.Номенклатура КАК Номенклатура,
			|	СУММА(РасходныйОрдерСкладТовары.Количество) КАК Количество,
			|	СУММА(РасходныйОрдерСкладТовары.КоличествоУРЗ) КАК КоличествоУРЗ,
			|	РасходныйОрдерСкладТовары.ЗаявкаНаСклад,
			|	СУММА(РасходныйОрдерСкладТовары.Отклонение) КАК Отклонение,
			|	ВЫБОР
			|		КОГДА РасходныйОрдерСкладТовары.ЗаданиеНаРазборку = ЗНАЧЕНИЕ(Документ.ЗаданиеНаРазборку.ПустаяСсылка)
			|			ТОГДА РасходныйОрдерСкладТовары.Сборщик
			|		ИНАЧЕ втЗадания.Сборщик
			|	КОНЕЦ КАК Сборщик,
			|	РасходныйОрдерСкладТовары.Склад,
			|	РасходныйОрдерСкладТовары.Получатель КАК ТорговаяТочка,
			|	РасходныйОрдерСкладТовары.ВыезднаяТорговля КАК ВыезднаяТорговля,
			|	РасходныйОрдерСкладТовары.Ссылка КАК Документ,
			|	НАЧАЛОПЕРИОДА(ВЫБОР
			|			КОГДА РасходныйОрдерСкладТовары.ДатаРаспределения <> ДАТАВРЕМЯ(1, 1, 1)
			|				ТОГДА РасходныйОрдерСкладТовары.ДатаРаспределения
			|			ИНАЧЕ РасходныйОрдерСкладТовары.Дата
			|		КОНЕЦ, ДЕНЬ) КАК Дата,
			|	СУММА(ВЫБОР
			|			КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) <= -0.5
			|				ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
			|			ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.Количество / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
			|		КОНЕЦ) КАК КоличествоУпаковок,
			|	СУММА(ВЫБОР
			|			КОГДА (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))) - РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) <= -0.5
			|				ТОГДА 1 + (ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0)))
			|			ИНАЧЕ ВЫРАЗИТЬ(РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЕСТЬNULL(ТабТовары.КоличествоВУпаковке, 1) КАК ЧИСЛО(15, 3))) КАК ЧИСЛО(15, 0))
			|		КОНЕЦ) КАК КоличествоУРЗУпаковок,
			|	МАКСИМУМ(ТабТовары.КоличествоВУпаковке) КАК КоличествоВУпаковке,
			|	РасходныйОрдерСкладТовары.ТипСтруктурнойЕдиницы,
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РасходныйОрдерСкладТовары.НомерСтроки) КАК НомерСтроки,
			|	ВЫБОР
			|		КОГДА РасходныйОрдерСкладТовары.ПриемкаВМагазинеБезПересчета = 1
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК ПриемкаБезПересчета,
			|	РасходныйОрдерСкладТовары.СкладВладелец,
			|	РасходныйОрдерСкладТовары.Организация,
			|	РасходныйОрдерСкладТовары.ЗаданиеНаРазборку
			|ИЗ
			|	ТабТоварыРасходники КАК РасходныйОрдерСкладТовары
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТабТовары КАК ТабТовары
			|		ПО РасходныйОрдерСкладТовары.Номенклатура = ТабТовары.Номенклатура
			|			И РасходныйОрдерСкладТовары.Ссылка = ТабТовары.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ втЗадания КАК втЗадания
			|		ПО РасходныйОрдерСкладТовары.ЗаданиеНаРазборку = втЗадания.Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	РасходныйОрдерСкладТовары.ЗаявкаНаСклад,
			|	РасходныйОрдерСкладТовары.Номенклатура,
			|	РасходныйОрдерСкладТовары.Ссылка,
			|	РасходныйОрдерСкладТовары.Склад,
			|	РасходныйОрдерСкладТовары.Получатель,
			|	РасходныйОрдерСкладТовары.ВыезднаяТорговля,
			|	РасходныйОрдерСкладТовары.ТипСтруктурнойЕдиницы,
			|	НАЧАЛОПЕРИОДА(ВЫБОР
			|			КОГДА РасходныйОрдерСкладТовары.ДатаРаспределения <> ДАТАВРЕМЯ(1, 1, 1)
			|				ТОГДА РасходныйОрдерСкладТовары.ДатаРаспределения
			|			ИНАЧЕ РасходныйОрдерСкладТовары.Дата
			|		КОНЕЦ, ДЕНЬ),
			|	ВЫБОР
			|		КОГДА РасходныйОрдерСкладТовары.ПриемкаВМагазинеБезПересчета = 1
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ,
			|	РасходныйОрдерСкладТовары.СкладВладелец,
			|	ВЫБОР
			|		КОГДА РасходныйОрдерСкладТовары.ЗаданиеНаРазборку = ЗНАЧЕНИЕ(Документ.ЗаданиеНаРазборку.ПустаяСсылка)
			|			ТОГДА РасходныйОрдерСкладТовары.Сборщик
			|		ИНАЧЕ втЗадания.Сборщик
			|	КОНЕЦ,
			|	РасходныйОрдерСкладТовары.Организация,
			|	РасходныйОрдерСкладТовары.ЗаданиеНаРазборку
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата,
			|	ТорговаяТочка,
			|	Номенклатура,
			|	Документ";
		
		Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийРасходСкладскойУчет.ОтгрузкаВТорговуюТочку);
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(Дата2));
		Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Дата1));
		Запрос.УстановитьПараметр("ДатаКон", КонецДня(Дата2)+3*24*60*60);
		Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Дата1)-3*24*60*60);
		
		Запрос.УстановитьПараметр("ТипСклада", Перечисления.ТипыСтруктурныхЕдиниц.Склад);
		Запрос.УстановитьПараметр("Владелец", Склад);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ТЗВыручка1 = РезультатЗапроса.Выгрузить();
		Если Сч=1 Тогда
			ТЗВыручка=ТЗВыручка1;
		Иначе	
			Для каждого Стр Из ТЗВыручка1 Цикл
				НовСтр=ТЗВыручка.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр,Стр);
			
			КонецЦикла; 
		КонецЕсли; 
		Если Дата2=НачалоДня(КонецПериода)Тогда
			Прервать;
		КонецЕсли;
		
		
		Сч=Сч+1;
		Дата1=Дата2+24*60*60;
		Дата2=?(НачалоДня(КонецПериода)<НачалоДня(Дата2)+5*24*60*60,НачалоДня(КонецПериода),НачалоДня(Дата2)+5*24*60*60);
	КонецЦикла;
	
	//+++АК BELN 2018.04.02
	ТаблицаДанныхПоПоступлению.Индексы.Добавить("Номенклатура,ТТ,День");
	
	ТаблицаДанныхПоПоступлениюИтог=ТаблицаДанныхПоПоступлению.СкопироватьКолонки();
	ТаблицаДанныхПоПоступлениюИтог.Колонки.Добавить("Расходник",Новый ОписаниеТипов("ДокументСсылка.РасходныйОрдерСклад"));
	//+++АК BELN 2018.12.04 ИП-00020631      
	ТаблицаДанныхПоПоступлениюИтог.Колонки.Добавить("ЗаданиеНаРазборку",Новый ОписаниеТипов("ДокументСсылка.ЗаданиеНаРазборку"));
	//---АК BELN 2018.12.04 
	
	Кол=ТЗВыручка.Количество();
	Сч=1;
	Для каждого Стр Из ТЗВыручка Цикл
		МасСтр=ТаблицаДанныхПоПоступлению.НайтиСтроки(Новый Структура("Номенклатура,ТТ,День",Стр.Номенклатура,Стр.ТорговаяТочка,Стр.Дата));	
		
		Если МасСтр.Количество() Тогда
			Если Сч=Кол Тогда
				ФлСлед=Ложь;
			Иначе	
				ФлСлед= (Стр.Номенклатура=ТЗВыручка[Сч].Номенклатура И Стр.ТорговаяТочка=ТЗВыручка[Сч].ТорговаяТочка И Стр.Дата=ТЗВыручка[Сч].Дата);
			КонецЕсли; 
			НовСтр=ТаблицаДанныхПоПоступлениюИтог.Добавить();
		    ЗаполнитьЗначенияСвойств(НовСтр,МасСтр[0]);
			Поступ=?(МасСтр[0].Поступило>Стр.Количество И ФлСлед,Стр.Количество,МасСтр[0].Поступило);
			МасСтр[0].Поступило=МасСтр[0].Поступило-Поступ;
			НовСтр.Поступило=Поступ;
			
			Бой=?(МасСтр[0].Бой>Стр.Количество И ФлСлед,Стр.Количество,МасСтр[0].Бой);
			МасСтр[0].Бой=МасСтр[0].Бой-Бой;
			НовСтр.Бой=Бой;
			НовСтр.Расходник=Стр.Документ;
			//+++АК BELN 2018.12.04 ИП-00020631      
			НовСтр.ЗаданиеНаРазборку=Стр.ЗаданиеНаРазборку;
			//---АК BELN 2018.12.04 
		КонецЕсли; 
	    Сч=Сч+1;
	КонецЦикла; 
	ТаблицаДанныхПоПоступлениюИтог.Индексы.Добавить("Номенклатура,ТТ,Расходник,ЗаданиеНаРазборку,День");
	ТЗВыручка.Индексы.Добавить("Номенклатура,ТорговаяТочка,Документ,ЗаданиеНаРазборку,Дата");
	//---АК BELN 2018.04.02 	

	
	//Сообщить("жжжжжжжжж");	
	ВнешниеНаборыДанных = Новый Структура;
    ВнешниеНаборыДанных.Вставить("ТаблицаДанныхПоПоступлению", ТаблицаДанныхПоПоступлениюИтог);
    ВнешниеНаборыДанных.Вставить("ТЗВыручка", ТЗВыручка);
	МакетКомпоновки = КомпоновщикМакета.Выполнить(
		СхемаКомпоновкиДанных, 
		НастройкиКомпоновкиДанных,
		ДанныеРасшифровки
	);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(
		МакетКомпоновки,
		ВнешниеНаборыДанных,
		ДанныеРасшифровки
	);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.НачатьВывод();
	ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
	ПроцессорВывода.ЗакончитьВывод();
	
КонецПроцедуры

Если СохраненнаяНастройка = Неопределено Тогда
	СохраненнаяНастройка =  Справочники.СохраненныеНастройки.ПустаяСсылка();
КонецЕсли;

Если КомпоновщикНастроек = Неопределено Тогда
	КомпоновщикНастроек =  Новый КомпоновщикНастроекКомпоновкиДанных;
КонецЕсли;

УправлениеОтчетамиИнфоком.ЗаменитьНазваниеПолейСхемыКомпоновкиДанных(СхемаКомпоновкиДанных);
